import React, {Component} from 'react';

class Offer extends Component {
    render() {
        return (
            <div style={{maxWidth: '900px', margin: '0 auto'}}>
                <b>Публичная оферта</b>
                <br/><br/>
Настоящий договор в соответствии с п. 2 ст. 462 Гражданского кодекса Республики Беларусь является Публичным договором (далее именуемый по тексту - «Договор»), определяет порядок розничной купли-продажи (реализации) абонементов на товар посредством мобильного приложения «GetCup», а также взаимные права, обязанности и порядок взаимоотношений между Индивидуальным предпринимателем Казаковым Сергеем Георгиевичем, именуемым в дальнейшем «Продавец», зарегистрированным Минским горисполкомом 18.01.2019 в ЕГР за № 193193937, и Физическим лицом, именуемым в дальнейшем «Покупатель», принявшим (акцептовавшим) публичное предложение (оферту) о заключении настоящего Договора, вместе далее именуемые «Стороны».
                <br/><br/>

1. ОБЩИЕ ПОЛОЖЕНИЯ. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
                <br/>1.1. Настоящий договор заключается и исполняется в соответствии с Гражданским кодексом Республики Беларусь от 07.12.1998 № 218-З, Законом Республики Беларусь от 08.01.2014 № 128-З «О государственном регулировании торговли и общественного питания в Республике Беларусь», Законом Республики Беларусь от 09.02.2002 № 90-З «О защите прав потребителей», постановлением Совета Министров Республики Беларусь от 22.12.2018 № 935 «О некоторых мерах по защите прав потребителей», постановлением Совета Министров Республики Беларусь от 15.01.2009 № 31 «Об утверждении Правил продажи товаров при осуществлении розничной торговли по образцам», а также иными нормативными правовыми актами Республики Беларусь.
                <br/>1.2. Термины и определения, применяемые в настоящем Договоре, используются в значении, закрепленном в нормативных правовых актах, указанных в п.1.1. настоящего Договора. При этом, если контекст Договора не требует иного, нижеприведенные термины имеют следующие значения:
                <br/>«Акцепт» – полное и безоговорочное принятие Покупателем условий настоящего Договора.
                <br/>«Мобильное приложение «GetCup», Мобильное приложение - информационный ресурс Продавца, посредством которого Покупателю предоставлена возможность приобрести абонемент Продавца и получить по нему товар, а именно: самостоятельно ознакомиться с информацией о товаре, выбрать товар и его количество, создав (сформировав) персональный абонемент посредством функциональных возможностей Мобильного приложения, внести предоплату и получить по нему товар в местах, указанных в абонементе на товар.
                <br/>«Абонемент на товар, Абонемент» - это документ Продавца, представленный в Мобильном приложении в электронном (цифровом) виде, созданный (сформированный) посредством функциональных возможностей Мобильного приложения непосредственными действиями и с участием Покупателя, удостоверяющий право Покупателя на получение товара в местах, указанных в таком документе.
                <br/>«Товар» – напитки кофе в ассортименте, сваренные (произведенные) третьими лицами, с которыми Продавцом установлены договорные отношения.
                <br/>«Цена Абонемента» – номинальная цена, по которой реализуется Абонемент Покупателю, равная Цене Товара, наименование, ассортимент, количество которого указано в Абонементе, либо общей стоимости таких Товаров, указанных в Абонементе.
                <br/>«Срок действия Абонемента» - период времени, равный количеству календарных дней с момента Оплаты Абонемента, в течение которого Абонемент является действительным и Покупатель имеет право получить по нему Товар. Срок действия Абонемента (в зависимости от его вида) устанавливается и указывается Продавцом до момента заключения настоящего договора.
                <br/>«Цена Товара» - розничная цена за единицу Товара, устанавливаемая Продавцом в белорусских рублях. Цена Товара доводится до сведения Покупателя в Мобильном приложении и в созданном Абонементе на товар.
                <br/>«Оформление Абонемента» - процесс самостоятельного выбора Покупателем Товара, создания (формирования) Абонемента и его оплаты посредством функциональных возможностей Мобильного приложения.
                <br/>«Оплата», «Оплата Абонемента» - расчет Покупателя за приобретаемый Абонемент на товар в форме безналичного расчета на условиях, предусмотренных настоящим договором.
                <br/><br/>
2. ПРЕДМЕТ ДОГОВОРА
                <br/>2.1. На условиях и в порядке, предусмотренном настоящим договором, Продавец обязуется передать в собственность Покупателя Абонемент, а Покупатель обязуется оплатить и принять его, чтобы в дальнейшем и в период срока действия Абонемента получить по нему Товар.
                <br/>2.2. Товар предоставляется Покупателю в объемах, являющихся стандартными в местах (объектах общественного питания), где реализуется право Покупателя на получение Товара по Абонементу.
                <br/>2.3. Сумма денежных средств, внесенная Покупателем при приобретении Абонемента, считается уплаченной в качестве предварительной оплаты (аванса).
                <br/>2.4. Оплата разницы между Ценой Абонемента и Ценой Товара либо суммарной ценой Товаров на момент передачи его (их) Покупателю по Абонементу не осуществляется и выдача сдачи по такому Абонементу не производится.
                <br/>2.5. Абонемент на Товар может быть использован только с помощью одной зарегистрированной в Мобильном приложении учетной записи Покупателя.
                <br/>2.6. В случаях утраты, кражи, порчи Абонемента, а равно в случае утраты доступа к учетной записи Покупателя в Мобильном приложении по обстоятельствам, за которые отвечает Покупатель, не позволяющих в совокупности идентифицировать Покупателя и его Абонемент, такой Абонемент не восстанавливается, не обменивается на новый, денежные средства, равные Цене Абонемента, возврату Покупателю не подлежат.
                <br/><br/>
3. ПОРЯДОК ЗАКЛЮЧЕНИЯ ДОГОВОРА
                <br/>3.1. Публикация (размещение) текста настоящего Договора является публичным предложением (офертой) Продавца, адресованным неопределенному кругу лиц заключить настоящий договор (п.2. ст.407 Гражданского Кодекса Республики Беларусь).
                <br/>3.2. Заключение настоящего Договора производится путем присоединения Покупателя к настоящему договору, то есть посредством принятия (акцепта) Покупателем условий настоящего договора в целом, без каких-либо условий, изъятий и оговорок (ст.398 Гражданского Кодекса Республики Беларусь).
                <br/>3.3. Настоящий договор, при условии соблюдения порядка его акцепта, считается заключенным в простой письменной форме (п.2, п.3 ст.404 и п.3 ст.408 Гражданского Кодекса Республики Беларусь).
                <br/>3.4. Настоящий договор является действительным в той редакции и на тех условиях, которые существовали на момент Оформления Абонемента.
                <br/>3.5. В Мобильном приложении может содержаться иная дополнительная информация о порядке и условиях реализации Абонементов по настоящему договору, их оплаты и получения по ним Товара. Указанная информация применяется в части не противоречащей условиям настоящего договора.
                <br/>3.6. Фактом полного и безоговорочного принятия (акцепта) Покупателем условий настоящего Договора является факт Оформления Абонемента (п.3 ст.408 Гражданского Кодекса Республики Беларусь).
                <br/>3.7. Для Оформления Абонемента Покупатель обязан воспользоваться Функциональными возможностями Мобильного приложения, заполнив предлагаемые для заполнения поля, последовательно руководствуясь предоставленными подсказками Мобильного приложения, и произвести его оплату.
                <br/>3.8. Оформляя Абонемент Покупатель подтверждает, что:
                <br/>- он предварительно ознакомился и обладает достаточной информацией по всем существенным условиям настоящего договора и принимает их без каких-либо оговорок и (или) изъятий;
                <br/>- он обладает достаточной правоспособностью и дееспособностью, позволяющие в совокупности в соответствии с действующим законодательством заключать и исполнять сделки, нести ответственность за их неисполнение и (или) ненадлежащее исполнение;
                <br/>- он понимает, что внешний вид Товара может отличаться от изображений, представленных в Мобильном приложении, все информационные материалы, представленные в Мобильном приложении, носят справочный характер;
                <br/>- денежные средства, иные законные средства расчетов, посредством которых совершается Оплата, принадлежат Покупателю на законных основаниях и он вправе ими распоряжаться;
                <br/>- он согласен на получение от Продавца через Мобильное приложение, иные средства связи (смс-сообщения, e-mail и т.п.) контактных данных о Продавце, а также другой информации об Продавце и его деятельности, в том числе информации рекламного характера.
                <br/><br/>
4. ПРАВА И ОБЯЗАННОСТИ СТОРОН
                <br/>4.1. Продавец обязан:
                <br/>4.1.1. Передать в собственность Покупателя Абонемент на Товар после его полной оплаты Покупателем;
                <br/>4.1.2. Обеспечить передачу Покупателю Товара по приобретенному и предъявленному им Абонементу в течение Срока действия Абонемента.
                <br/>4.1.2. Оказывать информационную и иную поддержку Покупателю при реализации им прав по Абонементу;
                <br/>4.1.3. Исполнять иные обязанности, предусмотренные законодательством Республики Беларусь и (или) настоящим договором.
                <br/>4.2. Продавец имеет право:
                <br/>4.2.1. По истечении Срока действия Абонемента отказать Покупателю в передаче Товара. При этом денежные средства, равные Цене Абонемента, возврату Покупателю не подлежат.
                <br/>4.2.2. Самостоятельно продлевать Срока действия Абонемента, в том числе в случаях на период временного приостановления обслуживания Покупателей. О таких обстоятельствах Покупатели уведомляются посредством Функциональных возможностей Мобильного приложения.
                <br/>4.2.3. Привлекать третьих лиц для исполнения настоящего Договора.
                <br/>4.2.4. Защиты своих прав и законных интересов в установленном настоящим договором и действующим законодательством порядке.
                <br/>4.2.5. В любое время в одностороннем внесудебном порядке отказаться от исполнения настоящего договора либо изменить условия настоящего договора, направив письменное уведомление Покупателю и (или) уведомив Покупателя посредством Функциональных возможностей Мобильного приложения, и (или) (электронной почты), указанной Покупателем в момент Оформления Абонемента. Настоящий договор прекращает свое действие или изменяется в момент отправки такого уведомления Продавцом Покупателю, если иное не указано в уведомлении, а в части взаиморасчетов – до полного возврата Покупателю уплаченных им денежных сумм при прекращении договора.
                <br/>4.2.6. На осуществление иных прав, предусмотренных действующим законодательством Республики Беларусь и (или) настоящим договором.
                <br/>4.3. Покупатель обязан:
                <br/>4.3.1. Сообщать достоверную информацию в ходе Оформления Абонемента и исполнения настоящего договора.
                <br/>4.3.2. Отвечать на телефонные звонки Продавца, а также на сообщения, уведомления Продавца, направленные Покупателю посредством функциональных возможностей Мобильного приложения и (или) электронной связи (почты) и (или) почтовым отправлением.
                <br/>4.3.3. Оплатить и принять Абонемент в порядке, предусмотренном настоящим договором.
                <br/>4.3.4. Возместить расходы Продавца по исполнению настоящего договора в случаях и в порядке предусмотренных настоящим договором и (или) действующим законодательством.
                <br/>4.3.5. Обеспечить вежливое и внимательное отношение ко всем работникам Продавца и третьих лиц, привлеченных Продавцом.
                <br/>4.3.6. Исполнять иные обязанности, предусмотренные законодательством Республики Беларусь и (или) настоящим договором.
                <br/>4.4. Покупатель имеет право на:
                <br/>4.4.1. Получение Товара в течение Срока действия Абонемента;
                <br/>4.4.2. Информационную и иную поддержку от Продавца при реализации Покупателем прав по Абонементу;
                <br/>4.4.3. Защиту своих прав и законных интересов в установленном настоящим договором и действующим законодательством порядке;
                <br/>4.4.4. Осуществление иных прав, предусмотренных действующим законодательством Республики Беларусь и (или) настоящим договором.
                <br/><br/>
5. ПОРЯДОК ИСПОЛНЕНИЯ ДОГОВОРА
                <br/>5.1. Продавец считается исполнившим свои обязательства по настоящему договору в момент передачи Покупателю Абонемента на Товар, а именно: в момент появления (отображения) оплаченного Абонемента в учетной записи Покупателя в Мобильном приложении.
                <br/>5.2. Продавец присваивает каждому Абонементу уникальный номер. Для получения Товара Покупатель обращается в места, указанные в Абонементе, и предъявляет Абонемент.
                <br/>При непосредственном обращении Покупателя в место, указанное в Абонементе, за получением Товара предварительно проверяется уникальный номер Абонемента путем сканирования штрих-кода (QR-кода) специальным устройством (смартфоном) с установленным Мобильным приложением.
                <br/>В случае действительности Абонемента Покупателю выдается Товар.
                <br/>5.3. Отказ Покупателя от реализации права, предоставленного Абонементом, не является отказом от исполнения настоящего договора, но является обстоятельством, за которые отвечает Покупатель.
                <br/>5.4. За нарушение принятых на себя обязательств каждая из Сторон по настоящему договору несет ответственность в соответствии с действующим законодательством. При этом Стороны освобождаются от ответственности за частичное или полное неисполнение своих обязательств по настоящему Договору, если это явилось следствием действия обстоятельств непреодолимой силы (форс-мажора), возникших после заключения настоящего Договора в результате событий чрезвычайного характера, которые Стороны не могли ни предвидеть, ни предотвратить разумными мерами.
                <br/>5.5. Все споры и разногласия, связанные с настоящим Договором, Стороны обязуются разрешать путем переговоров в порядке досудебного урегулирования споров, за исключением случаев, прямо указанных в настоящем договоре и (или) в действующем законодательстве Республики Беларусь. Срок рассмотрения и ответа претензии – 15 (пятнадцать) календарных дней с момента их получения.
                <br/>5.6. В случае если Сторонам не удастся разрешить все спорные вопросы в порядке, установленном п.5.5. настоящего Договора, все споры, возникающие из настоящего Договора, подлежат разрешению в судебном порядке в соответствии с законодательством Республики Беларусь.
                <br/><br/>
6. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ
                <br/>6.1. Настоящий договор вступает в силу с момента его Акцепта и действует в течение срока действия Абонемента или до момента получения Покупателем Товара по Абонементу, в зависимости от того, что из указанного наступит раньше.
                <br/>6.2. Стороны подтверждают и соглашаются с тем, что уведомления, переписка, сообщения, направляемые Сторонами посредством Функциональных возможностей Мобильного приложения и (или) электронной почты, указанной Покупателем в момент Оформления Абонемента, являются надлежащими и действительными, могут служить и использоваться Сторонами в качестве доказательств при разрешении споров, в том числе (но не исключительно) в суде.
                <br/>6.3. Изменения и (или) дополнения в настоящий договор вносятся в одностороннем порядке по решению Продавца, в том числе посредством последующего размещения в Мобильном приложении.
                <br/>6.4. Изменения и (или) дополнения, вносимые Продавцом в настоящий договор, вступают в силу не ранее чем через пять календарных дней после их утверждения, если иной срок не установлен самим Продавцом.
                <br/>6.5. Изменения и (или) дополнения, вносимые Продавцом в настоящий договор в связи с изменением законодательства, вступают в силу одновременно с вступлением в силу указанных изменений.
                <br/>6.6. Текст изменений и (или) дополнений настоящего договора, либо его новая редакция доводится Продавцом до всеобщего сведения посредством размещения (опубликования) соответствующей информации в Мобильном приложении с указанием даты вступления в силу таких изменений, за исключением случая, предусмотренного п. 6.5. настоящего договора.
                <br/>6.7.  Стороны безоговорочно соглашаются с тем, что настоящий договор заключен по месту нахождения Продавца.
                <br/>6.8. Продавец обязуется обрабатывать и хранить персональные данные Покупателя, предоставленные Продавцу, обеспечивать их конфиденциальность и не предоставлять доступ к этой информации третьим лицам, за исключением случаев, предусмотренных действующим законодательством Республики Беларусь.
                <br/>6.9. В случае если какое-либо из условий настоящего Договора потеряет юридическую силу, будет признанно незаконным, или будет исключено из настоящего Договора, то это не влечет недействительность остальных условий настоящего Договора, которые сохранят юридическую силу и являются, обязательными для исполнения всеми Сторонами.
                <br/>6.10. Все вопросы, неурегулированные настоящим Договором, разрешаются в соответствии с действующим законодательством Республики Беларусь, а также локальными нормативными документами Продавца, при условии их соответствия действующему законодательству Республики Беларусь.
                <br/>6.11. К отношениям, не урегулированным настоящим Договором, применяется общее гражданское законодательство Республики Беларусь, включая законодательство о защите прав потребителей.
            </div>
        );
    }
}

export default Offer;
